[
  {
    "text": "Patient John Smith, DOB 03/15/1978, presented with elevated blood pressure readings averaging 158/95 mmHg over the past three months. Patient has family history of cardiovascular disease. Started on lisinopril 10mg daily. Follow-up scheduled in 4 weeks.",
    "source": "real_ehr_export",
    "patient_id": "P-447281",
    "index": 2847
  },
  {
    "text": "Patient Mary Johnson, DOB 07/22/1965, diagnosed with Type 2 diabetes mellitus. HbA1c level 8.2%. Prescribed metformin 500mg twice daily. Dietary counseling provided. Referral to endocrinology pending.",
    "source": "real_ehr_export",
    "patient_id": "P-447282",
    "index": 2848
  },
  {
    "text": "Patient Robert Davis, DOB 11/03/1982, presenting with chronic lower back pain for 6 months. MRI shows L4-L5 disc herniation. Conservative treatment initiated with physical therapy. Pain management consultation requested.",
    "source": "real_ehr_export",
    "patient_id": "P-447283",
    "index": 2849
  },
  {
    "text": "Patient Sarah Williams, DOB 04/18/1990, acute appendicitis confirmed via CT scan. Surgical consult obtained. Scheduled for laparoscopic appendectomy. NPO status initiated. IV antibiotics started.",
    "source": "real_ehr_export",
    "patient_id": "P-447284",
    "index": 2850
  },
  {
    "text": "Patient James Brown, DOB 09/27/1955, follow-up for atrial fibrillation. Currently on warfarin with INR 2.4. Rate well controlled on metoprolol. No symptoms of stroke or bleeding. Continue current regimen.",
    "source": "real_ehr_export",
    "patient_id": "P-447285",
    "index": 2851
  },
  {
    "text": "Patient Linda Martinez, DOB 12/05/1973, new diagnosis of breast cancer, stage IIA. ER/PR positive, HER2 negative. Discussed treatment options including surgery, chemotherapy, and hormone therapy. Oncology team consulted.",
    "source": "real_ehr_export",
    "patient_id": "P-447286",
    "index": 2852
  },
  {
    "text": "Patient Michael Chen, DOB 02/14/1988, presenting with seasonal allergies. Symptoms include rhinorrhea, sneezing, itchy eyes. Prescribed cetirizine 10mg daily and fluticasone nasal spray. Allergen avoidance counseling provided.",
    "source": "real_ehr_export",
    "patient_id": "P-447287",
    "index": 2853
  },
  {
    "text": "Patient Jennifer Taylor, DOB 08/30/1969, routine colonoscopy performed. Three polyps removed, sent for pathology. No evidence of malignancy on initial inspection. Follow-up colonoscopy recommended in 3 years.",
    "source": "real_ehr_export",
    "patient_id": "P-447288",
    "index": 2854
  },
  {
    "text": "Patient David Wilson, DOB 06/11/1945, COPD exacerbation. SpO2 88% on room air. Started on supplemental oxygen, nebulizer treatments, and prednisone burst. Chest X-ray shows no pneumonia. Pulmonology consulted.",
    "source": "real_ehr_export",
    "patient_id": "P-447289",
    "index": 2855
  },
  {
    "text": "Patient Emily Anderson, DOB 01/25/1995, anxiety disorder with panic attacks. Started on sertraline 50mg daily. Cognitive behavioral therapy referral placed. Crisis hotline information provided. Follow-up in 2 weeks.",
    "source": "real_ehr_export",
    "patient_id": "P-447290",
    "index": 2856
  },
  {
    "text": "Patient Thomas Garcia, DOB 10/08/1960, presenting with gout flare in right great toe. Uric acid level 9.2 mg/dL. Prescribed colchicine for acute attack and discussed allopurinol for maintenance therapy.",
    "source": "real_ehr_export",
    "patient_id": "P-447291",
    "index": 2857
  },
  {
    "text": "Patient Amanda White, DOB 05/19/1987, prenatal visit at 28 weeks gestation. Fundal height appropriate. Fetal heart tones 145 bpm. Glucose challenge test scheduled. Reviewed warning signs for preeclampsia.",
    "source": "real_ehr_export",
    "patient_id": "P-447292",
    "index": 2858
  },
  {
    "text": "Patient Christopher Lee, DOB 03/02/1970, hypothyroidism follow-up. TSH 4.8 on current levothyroxine 75mcg. Dose increased to 88mcg. Recheck TSH in 6 weeks. Discussed symptoms of over/under treatment.",
    "source": "real_ehr_export",
    "patient_id": "P-447293",
    "index": 2859
  },
  {
    "text": "Patient Jessica Harris, DOB 07/14/1983, migraine headaches occurring 3-4 times monthly. Failed trial of propranolol. Starting topiramate 25mg nightly, titrate to 50mg. Headache diary provided.",
    "source": "real_ehr_export",
    "patient_id": "P-447294",
    "index": 2860
  },
  {
    "text": "Patient Daniel Clark, DOB 11/29/1952, prostate cancer surveillance. PSA stable at 0.4 ng/mL post-prostatectomy. No urinary symptoms. Digital rectal exam unremarkable. Continue annual monitoring.",
    "source": "real_ehr_export",
    "patient_id": "P-447295",
    "index": 2861
  },
  {
    "text": "Patient Nicole Robinson, DOB 09/06/1991, acute sinusitis with 10 days of symptoms. Green nasal discharge, facial pain. Prescribed amoxicillin-clavulanate for 10 days. Decongestant and saline irrigation recommended.",
    "source": "real_ehr_export",
    "patient_id": "P-447296",
    "index": 2862
  },
  {
    "text": "Patient Kevin Thompson, DOB 04/23/1967, diabetes management visit. HbA1c improved to 7.1% from 7.8%. Continuing metformin and glipizide. Reviewed hypoglycemia precautions. Annual eye exam due.",
    "source": "real_ehr_export",
    "patient_id": "P-447297",
    "index": 2863
  },
  {
    "text": "Patient Stephanie Moore, DOB 12/17/1980, annual wellness visit. BMI 24.3, BP 118/74. Lipid panel and metabolic panel ordered. Age-appropriate cancer screenings discussed. Immunizations up to date.",
    "source": "real_ehr_export",
    "patient_id": "P-447298",
    "index": 2864
  },
  {
    "text": "Patient Brian Jackson, DOB 08/04/1958, CHF exacerbation with 8lb weight gain. Increased furosemide dose. Strict 2L fluid restriction. Low sodium diet reinforced. Cardiology follow-up arranged.",
    "source": "real_ehr_export",
    "patient_id": "P-447299",
    "index": 2865
  },
  {
    "text": "Patient Michelle Young, DOB 02/28/1976, rheumatoid arthritis flare. Increased prednisone to 10mg daily for 2 weeks. Methotrexate continued. Rheumatology appointment next week for possible biologic therapy.",
    "source": "real_ehr_export",
    "patient_id": "P-447300",
    "index": 2866
  },
  {
    "text": "Hypertension is a chronic medical condition characterized by persistently elevated arterial blood pressure. Blood pressure is determined by cardiac output and systemic vascular resistance. Primary hypertension, accounting for 90-95% of cases, has no identifiable cause.",
    "source": "textbook",
    "index": 1001
  },
  {
    "text": "The pathophysiology of type 2 diabetes mellitus involves insulin resistance in peripheral tissues and relative insulin deficiency. Pancreatic beta cells initially compensate by increasing insulin secretion, but eventually fail to maintain euglycemia.",
    "source": "textbook",
    "index": 1002
  },
  {
    "text": "Acute coronary syndrome encompasses a spectrum of conditions from unstable angina to myocardial infarction. The underlying mechanism typically involves rupture of an atherosclerotic plaque with subsequent thrombus formation.",
    "source": "textbook",
    "index": 1003
  },
  {
    "text": "Chronic obstructive pulmonary disease is characterized by progressive airflow limitation that is not fully reversible. The two main phenotypes are chronic bronchitis and emphysema, though most patients have features of both.",
    "source": "textbook",
    "index": 1004
  },
  {
    "text": "Heart failure occurs when the heart cannot pump sufficient blood to meet metabolic demands. It can be classified as systolic (reduced ejection fraction) or diastolic (preserved ejection fraction) dysfunction.",
    "source": "textbook",
    "index": 1005
  },
  {
    "text": "Asthma is a chronic inflammatory disorder of the airways characterized by variable airflow obstruction, bronchial hyperresponsiveness, and underlying inflammation. Triggers include allergens, exercise, cold air, and respiratory infections.",
    "source": "textbook",
    "index": 1006
  },
  {
    "text": "Atrial fibrillation is the most common sustained cardiac arrhythmia. It is characterized by rapid, irregular atrial activation with loss of coordinated atrial contraction, leading to irregular ventricular response.",
    "source": "textbook",
    "index": 1007
  },
  {
    "text": "Osteoarthritis is a degenerative joint disease characterized by cartilage loss, subchondral bone changes, and osteophyte formation. Risk factors include age, obesity, joint injury, and genetic predisposition.",
    "source": "textbook",
    "index": 1008
  },
  {
    "text": "Major depressive disorder is characterized by persistent sad mood, anhedonia, sleep disturbances, appetite changes, fatigue, difficulty concentrating, and recurrent thoughts of death. Duration of at least 2 weeks is required for diagnosis.",
    "source": "textbook",
    "index": 1009
  },
  {
    "text": "Gastroesophageal reflux disease occurs when gastric contents reflux into the esophagus causing symptoms or complications. The lower esophageal sphincter dysfunction and hiatal hernia are common contributing factors.",
    "source": "textbook",
    "index": 1010
  },
  {
    "text": "Pneumonia is an infection of the lung parenchyma. Community-acquired pneumonia is most commonly caused by Streptococcus pneumoniae. Symptoms include cough, fever, dyspnea, and pleuritic chest pain.",
    "source": "textbook",
    "index": 1011
  },
  {
    "text": "Chronic kidney disease is defined as kidney damage or GFR less than 60 mL/min/1.73m2 for 3 months or more. Diabetes and hypertension are the leading causes. Management focuses on slowing progression and treating complications.",
    "source": "textbook",
    "index": 1012
  },
  {
    "text": "Hypothyroidism results from insufficient thyroid hormone production. Primary hypothyroidism, due to thyroid gland failure, is most common. Symptoms include fatigue, weight gain, cold intolerance, constipation, and dry skin.",
    "source": "textbook",
    "index": 1013
  },
  {
    "text": "Stroke is defined as acute neurological deficit due to vascular cause lasting more than 24 hours. Ischemic stroke accounts for approximately 85% of cases, while hemorrhagic stroke accounts for the remainder.",
    "source": "textbook",
    "index": 1014
  },
  {
    "text": "Peptic ulcer disease involves mucosal defects in the stomach or duodenum. Helicobacter pylori infection and NSAID use are the primary causes. Complications include bleeding, perforation, and gastric outlet obstruction.",
    "source": "textbook",
    "index": 1015
  },
  {
    "text": "Inflammatory bowel disease comprises Crohn's disease and ulcerative colitis. Both are chronic, relapsing inflammatory conditions of the gastrointestinal tract with distinct pathological and clinical features.",
    "source": "textbook",
    "index": 1016
  },
  {
    "text": "Parkinson's disease is a neurodegenerative disorder characterized by bradykinesia, rigidity, resting tremor, and postural instability. The underlying pathology involves loss of dopaminergic neurons in the substantia nigra.",
    "source": "textbook",
    "index": 1017
  },
  {
    "text": "Alzheimer's disease is the most common cause of dementia. Pathological hallmarks include amyloid plaques and neurofibrillary tangles. Clinical features include progressive memory loss, cognitive decline, and behavioral changes.",
    "source": "textbook",
    "index": 1018
  },
  {
    "text": "Cirrhosis represents end-stage liver disease characterized by fibrosis and regenerative nodules. Common causes include alcohol, viral hepatitis, and nonalcoholic fatty liver disease. Complications include portal hypertension and hepatocellular carcinoma.",
    "source": "textbook",
    "index": 1019
  },
  {
    "text": "Sepsis is life-threatening organ dysfunction caused by dysregulated host response to infection. Early recognition and prompt administration of antibiotics and fluid resuscitation are critical for survival.",
    "source": "textbook",
    "index": 1020
  },
  {
    "text": "Anemia is defined as reduced hemoglobin concentration below normal range. Classification by MCV helps determine etiology: microcytic (iron deficiency, thalassemia), normocytic (chronic disease), or macrocytic (B12/folate deficiency).",
    "source": "textbook",
    "index": 1021
  },
  {
    "text": "Venous thromboembolism encompasses deep vein thrombosis and pulmonary embolism. Virchow's triad of stasis, endothelial injury, and hypercoagulability describes the pathophysiology. Anticoagulation is the mainstay of treatment.",
    "source": "textbook",
    "index": 1022
  },
  {
    "text": "Epilepsy is characterized by recurrent unprovoked seizures. Classification includes focal and generalized seizures. Antiepileptic drug selection depends on seizure type, patient factors, and potential side effects.",
    "source": "textbook",
    "index": 1023
  },
  {
    "text": "Multiple sclerosis is an autoimmune demyelinating disease of the central nervous system. Clinical manifestations include optic neuritis, sensory symptoms, motor weakness, and cerebellar dysfunction with relapsing-remitting course in most patients.",
    "source": "textbook",
    "index": 1024
  },
  {
    "text": "Systemic lupus erythematosus is a multisystem autoimmune disease with diverse clinical manifestations including malar rash, arthritis, nephritis, serositis, and neurological involvement. ANA positivity is highly sensitive but not specific.",
    "source": "textbook",
    "index": 1025
  },
  {
    "text": "Pancreatitis presents with epigastric pain radiating to the back, nausea, and vomiting. Gallstones and alcohol are the most common causes. Severity ranges from mild edematous to severe necrotizing pancreatitis.",
    "source": "textbook",
    "index": 1026
  },
  {
    "text": "Thyroid nodules are common, with most being benign. Fine needle aspiration biopsy is the key diagnostic test. Suspicious features include rapid growth, fixation, lymphadenopathy, and certain ultrasound characteristics.",
    "source": "textbook",
    "index": 1027
  },
  {
    "text": "Urinary tract infections are among the most common bacterial infections. Uncomplicated cystitis in women can be treated with short-course antibiotics. Complicated UTIs require longer treatment and may need imaging evaluation.",
    "source": "textbook",
    "index": 1028
  },
  {
    "text": "Osteoporosis is characterized by decreased bone mineral density and increased fracture risk. Dual-energy X-ray absorptiometry (DXA) is the standard diagnostic test. Treatment includes calcium, vitamin D, and antiresorptive medications.",
    "source": "textbook",
    "index": 1029
  },
  {
    "text": "Gout is caused by deposition of monosodium urate crystals in joints and soft tissues. Acute attacks present with sudden onset of severe joint pain, swelling, and erythema. Long-term management focuses on urate-lowering therapy.",
    "source": "textbook",
    "index": 1030
  },
  {
    "text": "Peripheral artery disease results from atherosclerotic narrowing of limb arteries. Intermittent claudication is the hallmark symptom. Ankle-brachial index is the key diagnostic test. Treatment includes risk factor modification and revascularization.",
    "source": "textbook",
    "index": 1031
  },
  {
    "text": "Celiac disease is an immune-mediated enteropathy triggered by gluten ingestion in genetically susceptible individuals. Diagnosis requires positive serology and small bowel biopsy. Lifelong gluten-free diet is the treatment.",
    "source": "textbook",
    "index": 1032
  },
  {
    "text": "Benign prostatic hyperplasia is common in older men, causing lower urinary tract symptoms. Medical treatment includes alpha-blockers and 5-alpha reductase inhibitors. Surgical options include TURP for refractory cases.",
    "source": "textbook",
    "index": 1033
  },
  {
    "text": "Diverticulosis is common in Western populations. Diverticulitis occurs when diverticula become inflamed or infected. Uncomplicated diverticulitis is treated with antibiotics and bowel rest; complicated cases may require intervention.",
    "source": "textbook",
    "index": 1034
  },
  {
    "text": "Hepatitis B is a DNA virus transmitted through blood and body fluids. Acute infection may resolve or progress to chronic hepatitis. Chronic HBV increases risk of cirrhosis and hepatocellular carcinoma. Vaccination is highly effective for prevention.",
    "source": "textbook",
    "index": 1035
  },
  {
    "text": "Hepatitis C is an RNA virus primarily transmitted through blood exposure. Most acute infections become chronic. Direct-acting antivirals have revolutionized treatment, achieving cure rates exceeding 95% in most patients.",
    "source": "textbook",
    "index": 1036
  },
  {
    "text": "Tuberculosis remains a significant global health problem. Pulmonary TB is the most common form. Diagnosis requires clinical suspicion, imaging, and microbiological confirmation. Standard treatment is 6 months of combination therapy.",
    "source": "textbook",
    "index": 1037
  },
  {
    "text": "HIV infection progresses through acute, chronic, and AIDS stages if untreated. Antiretroviral therapy has transformed HIV into a manageable chronic condition. Pre-exposure prophylaxis is effective for prevention in high-risk individuals.",
    "source": "textbook",
    "index": 1038
  },
  {
    "text": "Melanoma is the most deadly form of skin cancer. Risk factors include UV exposure, fair skin, and atypical moles. The ABCDE criteria help identify suspicious lesions. Early detection and surgical excision are critical for survival.",
    "source": "textbook",
    "index": 1039
  },
  {
    "text": "Colorectal cancer is the third most common cancer worldwide. Screening with colonoscopy reduces mortality through detection and removal of precancerous polyps. Treatment depends on stage and may include surgery, chemotherapy, and radiation.",
    "source": "textbook",
    "index": 1040
  },
  {
    "text": "Lung cancer is the leading cause of cancer death. Smoking is the primary risk factor. Low-dose CT screening is recommended for high-risk individuals. Treatment modalities include surgery, radiation, chemotherapy, and targeted therapies.",
    "source": "textbook",
    "index": 1041
  },
  {
    "text": "Breast cancer screening with mammography reduces mortality in women aged 50-74. Risk factors include age, family history, BRCA mutations, and hormone exposure. Treatment is multimodal based on tumor characteristics and stage.",
    "source": "textbook",
    "index": 1042
  },
  {
    "text": "Prostate cancer is common in older men. PSA screening remains controversial due to overdiagnosis concerns. Active surveillance is appropriate for low-risk disease. Treatment options include surgery, radiation, and hormonal therapy.",
    "source": "textbook",
    "index": 1043
  },
  {
    "text": "Leukemia represents a group of hematological malignancies. Classification includes acute vs chronic and lymphoid vs myeloid types. Treatment varies by subtype and may include chemotherapy, targeted therapy, and stem cell transplant.",
    "source": "textbook",
    "index": 1044
  },
  {
    "text": "Lymphoma includes Hodgkin and non-Hodgkin types. Presentation typically includes lymphadenopathy, B symptoms, and sometimes extranodal involvement. PET-CT is important for staging. Treatment depends on histology and stage.",
    "source": "textbook",
    "index": 1045
  },
  {
    "text": "Pancreatic cancer has poor prognosis due to late presentation. Risk factors include smoking, obesity, and chronic pancreatitis. Surgical resection offers the only chance for cure but is possible in only 15-20% of patients.",
    "source": "textbook",
    "index": 1046
  },
  {
    "text": "Ovarian cancer often presents at advanced stage due to nonspecific symptoms. CA-125 is a useful tumor marker. Treatment typically includes debulking surgery and platinum-based chemotherapy.",
    "source": "textbook",
    "index": 1047
  },
  {
    "text": "Bladder cancer most commonly presents with painless hematuria. Smoking is the primary risk factor. Superficial tumors are treated with transurethral resection and intravesical therapy; muscle-invasive disease requires cystectomy or chemoradiation.",
    "source": "textbook",
    "index": 1048
  },
  {
    "text": "Renal cell carcinoma classically presents with hematuria, flank pain, and palpable mass, though this triad is uncommon. Incidental detection on imaging is increasingly common. Surgical resection remains the primary treatment.",
    "source": "textbook",
    "index": 1049
  },
  {
    "text": "Thyroid cancer is usually indolent with excellent prognosis. Papillary carcinoma is the most common type. Treatment includes thyroidectomy, radioactive iodine ablation for appropriate cases, and TSH suppression therapy.",
    "source": "textbook",
    "index": 1050
  },
  {
    "text": "Case study: A middle-aged individual presented with fatigue and polyuria. Laboratory evaluation revealed elevated fasting glucose. After lifestyle modifications and medication adjustment, glycemic control improved significantly over six months.",
    "source": "synthetic",
    "index": 3001
  },
  {
    "text": "Case study: An elderly person with history of heart disease developed increasing shortness of breath and lower extremity edema. Diuretic therapy was optimized with significant symptomatic improvement.",
    "source": "synthetic",
    "index": 3002
  },
  {
    "text": "Case study: A young adult experienced recurrent episodes of wheezing and chest tightness. Pulmonary function testing confirmed obstructive pattern with bronchodilator reversibility. Controller therapy was initiated.",
    "source": "synthetic",
    "index": 3003
  },
  {
    "text": "Case study: A patient with chronic back pain underwent comprehensive evaluation. Conservative management including physical therapy and NSAIDs provided adequate pain relief without need for surgical intervention.",
    "source": "synthetic",
    "index": 3004
  },
  {
    "text": "Case study: An individual presented with progressive memory difficulties. Cognitive testing and neuroimaging were performed. Early-stage neurodegenerative process was diagnosed and supportive care initiated.",
    "source": "synthetic",
    "index": 3005
  },
  {
    "text": "Case study: A patient undergoing routine screening colonoscopy was found to have adenomatous polyps. These were removed endoscopically and surveillance colonoscopy was scheduled per guidelines.",
    "source": "synthetic",
    "index": 3006
  },
  {
    "text": "Case study: An individual with persistent heartburn despite lifestyle modifications was started on proton pump inhibitor therapy with significant symptom relief at follow-up.",
    "source": "synthetic",
    "index": 3007
  },
  {
    "text": "Case study: A patient with newly diagnosed hypertension achieved blood pressure goal with combination of lifestyle modifications and single antihypertensive agent.",
    "source": "synthetic",
    "index": 3008
  },
  {
    "text": "Case study: An individual experiencing persistent sadness and loss of interest was diagnosed with depressive disorder. Combination of medication and psychotherapy resulted in remission.",
    "source": "synthetic",
    "index": 3009
  },
  {
    "text": "Case study: A patient with recurrent joint pain was diagnosed with inflammatory arthritis. Disease-modifying therapy was initiated early, preventing joint damage progression.",
    "source": "synthetic",
    "index": 3010
  },
  {
    "text": "Case study: An individual with abnormal thyroid function tests was found to have autoimmune thyroiditis. Hormone replacement achieved euthyroid state with resolution of symptoms.",
    "source": "synthetic",
    "index": 3011
  },
  {
    "text": "Case study: A patient presenting with chest pain underwent cardiac evaluation. Stress testing was negative and symptoms were attributed to musculoskeletal etiology.",
    "source": "synthetic",
    "index": 3012
  },
  {
    "text": "Case study: An individual with chronic cough was evaluated systematically. Post-nasal drip was identified as the cause and treated with nasal corticosteroids.",
    "source": "synthetic",
    "index": 3013
  },
  {
    "text": "Case study: A patient with elevated liver enzymes underwent comprehensive workup. Fatty liver disease was diagnosed and lifestyle intervention implemented.",
    "source": "synthetic",
    "index": 3014
  },
  {
    "text": "Case study: An individual with recurrent urinary tract infections underwent urological evaluation. Behavioral modifications and prophylactic measures reduced infection frequency.",
    "source": "synthetic",
    "index": 3015
  },
  {
    "text": "Case study: A patient with abnormal screening mammogram underwent additional imaging and biopsy. Benign findings were confirmed with recommendation for routine screening.",
    "source": "synthetic",
    "index": 3016
  },
  {
    "text": "Case study: An individual experiencing chronic insomnia participated in cognitive behavioral therapy program with significant improvement in sleep quality.",
    "source": "synthetic",
    "index": 3017
  },
  {
    "text": "Case study: A patient with osteopenia identified on screening DXA implemented calcium, vitamin D supplementation, and weight-bearing exercise program.",
    "source": "synthetic",
    "index": 3018
  },
  {
    "text": "Case study: An individual with prediabetes achieved normal glucose levels through intensive lifestyle intervention including dietary changes and regular exercise.",
    "source": "synthetic",
    "index": 3019
  },
  {
    "text": "Case study: A patient with chronic obstructive symptoms was counseled on smoking cessation and started on appropriate inhaler therapy with improvement in exercise tolerance.",
    "source": "synthetic",
    "index": 3020
  },
  {
    "text": "Case study: An individual with unexplained weight loss underwent thorough evaluation. No malignancy was identified and symptoms resolved with nutritional support.",
    "source": "synthetic",
    "index": 3021
  },
  {
    "text": "Case study: A patient with chronic headaches was diagnosed with tension-type headache. Stress management and analgesic use optimization provided relief.",
    "source": "synthetic",
    "index": 3022
  },
  {
    "text": "Case study: An individual with palpitations underwent cardiac monitoring. Benign premature beats were identified and reassurance provided.",
    "source": "synthetic",
    "index": 3023
  },
  {
    "text": "Case study: A patient with skin rash was evaluated by dermatology. Contact dermatitis was diagnosed and treated with topical corticosteroids and allergen avoidance.",
    "source": "synthetic",
    "index": 3024
  },
  {
    "text": "Case study: An individual with knee pain underwent evaluation showing early osteoarthritis. Conservative measures including weight management and physical therapy were initiated.",
    "source": "synthetic",
    "index": 3025
  },
  {
    "text": "Case study: A patient with abdominal bloating was diagnosed with irritable bowel syndrome after appropriate workup excluded organic pathology. Dietary modifications provided relief.",
    "source": "synthetic",
    "index": 3026
  },
  {
    "text": "Case study: An individual presenting with dizziness underwent comprehensive evaluation. Benign positional vertigo was diagnosed and treated with repositioning maneuvers.",
    "source": "synthetic",
    "index": 3027
  },
  {
    "text": "Case study: A patient with peripheral edema was evaluated. Venous insufficiency was identified and compression therapy along with leg elevation was recommended.",
    "source": "synthetic",
    "index": 3028
  },
  {
    "text": "Case study: An individual with chronic fatigue underwent extensive workup. Sleep apnea was diagnosed and CPAP therapy significantly improved energy levels.",
    "source": "synthetic",
    "index": 3029
  },
  {
    "text": "Case study: A patient with elevated cholesterol achieved lipid goals through combination of statin therapy and dietary modifications at three-month follow-up.",
    "source": "synthetic",
    "index": 3030
  }
]
